1password
amazon-music
appcleaner
appzapper
atom
caffeine
calibre
cocktail
deltawalker
dragondisk
expandrive
firefox
flux
google-drive
hermes
imageoptim
istat-menus
java
macdown
macid
moom
mou
ngrok
omnifocus
onyx
paw
postbox
rstudio
screenhero
sequel-pro
skitch
slack
sonos
sourcetree
spotify
steam
superduper
the-unarchiver
transmission
virtualbox
visual-studio-code
vivaldi
whatsize
wkhtmltopdf
