tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "puma/puma"
tap "thoughtbot/formulae"
brew "asdf"
brew "sqlite"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "circleci"
brew "diff-so-fancy"
brew "direnv"
brew "duti"
brew "entr"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "git-filter-repo"
brew "git-lfs"
brew "git-sizer"
brew "hexyl"
brew "hr"
brew "htop"
brew "httpie"
brew "httpstat"
brew "httrack"
brew "hub"
brew "hyperfine"
brew "jq"
brew "lnav"
brew "lynis"
brew "mackup"
brew "magic-wormhole"
brew "moreutils"
brew "mosh"
brew "mysql@5.7", link: true
brew "ngrep"
brew "node"
brew "noti"
brew "numpy"
brew "tmux"
brew "overmind"
brew "peco"
brew "pgcli"
brew "postgresql"
brew "prettyping"
brew "pv"
brew "qpdf"
brew "qt"
brew "redis", restart_service: true
brew "ripgrep"
brew "shellcheck"
brew "ssh-copy-id", link: true
brew "starship"
brew "terraform"
brew "tig"
brew "tldr"
brew "tokei"
brew "tree"
brew "watch"
brew "wget"
brew "wrk"
brew "yarn"
brew "youtube-dl"
brew "z"
brew "heroku/brew/heroku"
brew "mas-cli/tap/mas"
brew "puma/puma/puma-dev"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "a-better-finder-attributes"
cask "a-better-finder-rename"
cask "alfred"
cask "anaconda"
cask "anki"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "arq"
cask "bartender"
cask "bbedit"
cask "beekeeper-studio"
cask "bettertouchtool"
cask "bookmacster"
cask "calibre"
cask "choosy"
cask "chromedriver"
cask "clipgrab"
cask "daisydisk"
cask "dash"
cask "default-folder-x"
cask "deltawalker"
cask "divvy"
cask "docker"
cask "dosbox"
cask "dosbox-x"
cask "dropbox"
cask "dropzone"
cask "dupeguru"
cask "expandrive"
cask "expressvpn"
cask "falcon-sql-client"
cask "firefox"
cask "fluid"
cask "flux"
cask "font-anonymous-pro"
cask "font-bitstream-vera"
cask "font-camingocode"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-public-sans"
cask "font-source-code-pro"
cask "github"
cask "gitup"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "grandperspective"
cask "graphql-playground"
cask "hammerspoon"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "joplin"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keybase"
cask "keyboard-maestro"
cask "keycue"
cask "krita"
cask "licecap"
cask "little-snitch"
cask "lunar"
cask "macbreakz"
cask "macdown"
cask "marp"
cask "micro-snitch"
cask "monitorcontrol"
cask "muzzle"
cask "ngrok"
cask "nightowl"
cask "omnifocus"
cask "onyx"
cask "path-finder"
cask "paw"
cask "polar-bookshelf"
cask "powershell"
cask "qbserve"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rocket"
cask "selfcontrol"
cask "sequel-pro-nightly"
cask "session-manager-plugin"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spectacle"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "superduper"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "the-unarchiver"
cask "trailer"
cask "transmission"
cask "tuple"
cask "vagrant"
cask "vcv-rack"
cask "visual-studio-code"
cask "vlc"
cask "waltr"
cask "yacreader"
cask "zotero"
cask "zulip"
mas "Amphetamine", id: 937984704
mas "ASUS Device Discovery", id: 995124504
mas "ASUS Firmware Restoration", id: 1020519014
mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "Deliveries", id: 924726344
mas "DuckDuckGo Privacy Essentials", id: 1482920575
mas "Focus Matrix", id: 1087284172
mas "GarageBand", id: 682658836
mas "Ghostery Lite", id: 1436953057
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "myTuner Radio", id: 881415018
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Reeder", id: 1449412482
mas "Save to Pocket", id: 1477385213
mas "SomaFM", id: 449155338
mas "Spark", id: 1176895641
mas "StopTheMadness", id: 1376402589
mas "Xcode", id: 497799835
