alfred
appcleaner
aptible
arq
betterzipql
caffeine
controlplane
dash
deltawalker
divvy
docker
dropbox
expandrive
firefox
fluid
flume
istat-menus
iterm2
java
keybase
kitematic
macdown
omnifocus
paw
qlcolorcode
qlimagesize
qlmarkdown
qlprettypatch
qlstephen
quicklook-csv
quicklook-json
rescuetime
skype
sourcetree
spotify
strongvpn-client
sublime-text
superduper
