1password
appcleaner
appzapper
atom
caffeine
cocktail
flux
hermes
istat-menus
moom
ngrok
omnifocus
onyx
paw
rstudio
sequel-pro
skitch
skype
slack
sonos
sourcetree
spotify
steam
superduper
transmission
whatsize
