brew "asdf"
brew "direnv"
brew "htop"
brew "httpie"
brew "hub"
brew "git-extras"
brew "jq"
brew "shellcheck"
brew "sloccount"
brew "yarn", args: ["without-node"]

tap "homebrew/services"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "redis", restart_service: true

tap "heroku/brew"
brew "heroku"

tap "puma/puma"
brew "puma/puma/puma-dev"

tap "homebrew/cask-versions"
cask "firefox-developer-edition"

# cask "java"
# brew "cask-repair"
# brew "certbot"
# brew "csv-fix"
# brew "ctags"
# brew "elasticsearch"
# brew "elixir"
# brew "erlang"
# cask "elm-platform"
# brew "exercism"
# brew "percona-toolkit"
# brew "pgtune"
# brew "imagemagick@6"
# brew "phantomjs"
# brew "sqlite"
# brew "python"
# brew "r"
# brew "reattach-to-user-namespace"
# brew "the_silver_searcher"
# brew "tmate"
# brew "tmux"

# tap "staticfloat/julia"
# brew "staticfloat/julia/julia"

cask "atom"
cask "deltawalker"
# cask "dragondisk"
# cask "github"
cask "imageoptim"
cask "licecap"
# cask "ngrok"
cask "paw"
# cask "rstudio"
cask "sequel-pro"
cask "sourcetree"
# cask "tableau-public"
cask "visual-studio-code"
