tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "puma/puma"
tap "xwmx/taps"
brew "asdf"
brew "bash"
brew "bash-completion"
brew "bat"
brew "broot"
brew "chezmoi"
brew "diff-so-fancy"
brew "direnv"
brew "exa"
brew "exercism"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-extras"
brew "hexyl"
brew "hivemind"
brew "hr"
brew "htop"
brew "httpie"
brew "httpstat"
brew "httrack"
brew "hyperfine"
brew "jq"
brew "jrnl"
brew "lnav"
brew "lsd"
brew "lynis"
brew "mackup"
brew "magic-wormhole"
brew "mas"
brew "micro"
brew "moreutils"
brew "mysql@5.7", restart_service: true, link: true
brew "ngrep"
brew "overmind"
brew "pgcli"
brew "pinentry-mac"
brew "postgresql", restart_service: true
brew "prettyping"
brew "pv"
brew "q"
brew "qpdf"
brew "rclone"
brew "redis", restart_service: true
brew "ripgrep"
brew "ripgrep-all"
brew "shellcheck"
brew "starship"
brew "tldr"
brew "tokei"
brew "yq"
brew "zoxide"
brew "zplug"
brew "heroku/brew/heroku"
brew "mas-cli/tap/mas"
brew "puma/puma/puma-dev"
brew "xwmx/taps/nb"
cask "1password"
cask "1password-cli"
cask "a-better-finder-attributes"
cask "a-better-finder-rename"
cask "alfred"
cask "anaconda"
cask "another-redis-desktop-manager"
cask "appcleaner"
cask "arq"
cask "background-music"
cask "bartender"
cask "bbedit"
cask "beekeeper-studio"
cask "bettertouchtool"
cask "bookmacster"
cask "caldigit-docking-utility"
cask "caldigit-thunderbolt-charging"
cask "calibre"
cask "camo-studio"
cask "cardhop"
cask "choosy"
cask "chromedriver"
cask "clipgrab"
cask "daisydisk"
cask "dash"
cask "default-folder-x"
cask "deltawalker"
cask "divvy"
cask "docker"
cask "dosbox-x"
cask "dropbox"
cask "dupeguru"
cask "elgato-control-center"
cask "elgato-stream-deck"
cask "expandrive"
cask "expressvpn"
cask "falcon-sql-client"
cask "fantastical"
cask "firefox"
cask "fluid"
cask "font-anonymice-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-camingocode"
cask "font-dejavu-sans"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-open-sans"
cask "font-public-sans"
cask "font-sauce-code-pro-nerd-font"
cask "freetube"
cask "freeyourmusic"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "graphql-playground"
cask "hammerspoon"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "insomnia"
cask "istat-menus"
cask "iterm2"
cask "joplin"
cask "kaleidoscope"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keka"
cask "keyboard-maestro"
cask "keycastr"
cask "keycue"
cask "licecap"
cask "little-snitch"
cask "macbreakz"
cask "macdown"
cask "mailtrackerblocker"
cask "marta"
cask "micro-snitch"
cask "muzzle"
cask "ngrok"
cask "obsidian"
cask "omnifocus"
cask "onyx"
cask "path-finder"
cask "paw"
cask "polar-bookshelf"
cask "qbserve"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "rectangle"
cask "rocket"
cask "selfcontrol"
cask "sequel-pro-nightly"
cask "signal"
cask "slack"
cask "sonos-s1-controller"
cask "soundsource"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "stretchly"
cask "superduper"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "the-unarchiver"
cask "transmission"
cask "vcv-rack"
cask "visual-studio-code"
cask "waltr"
cask "yacreader"
cask "zsa-wally"
cask "zulip"
mas "Be Focused Pro", id: 961632517
mas "Deliveries", id: 924726344
mas "Focus Matrix", id: 1087284172
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "myTuner Radio", id: 881415018
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Reeder", id: 1449412482
mas "Save to Pocket", id: 1477385213
mas "SomaFM", id: 449155338
mas "Spark", id: 1176895641
mas "StopTheMadness", id: 1376402589
mas "Xcode", id: 497799835
