tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "mas-cli/tap"
tap "puma/puma"
tap "thoughtbot/formulae"
brew "asdf"
brew "sqlite"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "python", link: false
brew "glib"
brew "clamav"
brew "credstash"
brew "direnv"
brew "exercism"
brew "geos"
brew "proj"
brew "numpy"
brew "qt"
brew "poppler"
brew "gdal"
brew "git"
brew "git-extras"
brew "git-lfs"
brew "go"
brew "highlight"
brew "htop"
brew "httpie"
brew "hub"
brew "imagemagick"
brew "jq"
brew "mysql@5.7", link: true
brew "node"
brew "postgresql@11"
brew "qpdf"
brew "redis"
brew "shellcheck"
brew "sloccount"
brew "ssh-copy-id"
brew "sshrc"
brew "wget"
brew "yarn"
brew "z"
brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "mas-cli/tap/mas"
brew "puma/puma/puma-dev"
brew "thoughtbot/formulae/parity"
brew "thoughtbot/formulae/rcm"
cask "1password"
cask "a-better-finder-attributes"
cask "alfred"
cask "anki"
cask "appcleaner"
cask "bartender"
cask "bbedit"
cask "brave-browser"
cask "calibre"
cask "choosy"
cask "chromedriver"
cask "daisydisk"
cask "dash"
cask "deltawalker"
cask "divvy"
cask "docker"
cask "dosbox"
cask "dropbox"
cask "dropzone"
cask "dupeguru"
cask "expandrive"
cask "expressvpn"
cask "firefox"
cask "fluid"
cask "flume"
cask "font-anonymous-pro"
cask "font-bitstream-vera"
cask "font-dejavu-sans"
cask "font-fira-code"
cask "font-hack"
cask "font-inconsolata"
cask "font-jetbrains-mono"
cask "font-open-sans"
cask "font-source-code-pro"
cask "github"
cask "gitup"
cask "google-chrome"
cask "handbrake"
cask "hazel"
cask "imageoptim"
cask "istat-menus"
cask "iterm2"
cask "keepingyouawake"
cask "keybase"
cask "keycue"
cask "krisp"
cask "licecap"
cask "little-snitch"
cask "macbreakz"
cask "macdown"
cask "marp"
cask "monitorcontrol"
cask "netnewswire"
cask "ngrok"
cask "nightowl"
cask "nvalt"
cask "omnifocus"
cask "onyx"
cask "paw"
cask "qbserve"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "rocket"
cask "selfcontrol"
cask "sequel-pro-nightly"
cask "session-manager-plugin"
cask "slack"
cask "sonos"
cask "sourcetree"
cask "spotify"
cask "steam"
cask "sublime-text"
cask "superduper"
cask "the-unarchiver"
cask "tower"
cask "trailer"
cask "transmission"
cask "vcv-rack"
cask "visual-studio-code"
cask "vlc"
cask "waltr"
cask "yacreader"
cask "zulip"
mas "Amphetamine", id: 937984704
mas "ASUS Device Discovery", id: 995124504
mas "ASUS Firmware Restoration", id: 1020519014
mas "Be Focused Pro", id: 961632517
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "GarageBand", id: 682658836
mas "Ghostery Lite", id: 1436953057
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Monosnap", id: 540348655
mas "myTuner Radio", id: 881415018
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "Reeder", id: 880001334
mas "Save to Pocket", id: 1477385213
mas "Spark", id: 1176895641
mas "Tomato One", id: 907364780
mas "VOX", id: 461369673
mas "Xcode", id: 497799835
