brew "asdf"
brew "direnv"
brew "htop"
brew "httpie"
brew "hub"
brew "git-extras"
brew "gpg"
brew "jq"
brew "qt@5.5"
brew "ruby-build"
brew "rbenv"
brew "rbenv-default-gems"
brew "rbenv-gemset"
brew "reattach-to-user-namespace"
brew "shellcheck"
brew "sloccount"
brew "tmux"
brew "yarn" args: ["without-node"]



tap "homebrew/services"
brew "mysql", restart_service: true
brew "postgresql", restart_service: true
brew "redis", restart_service: true

tap "heroku/brew"
brew "heroku"

tap "puma/puma"
brew "puma/puma/puma-dev"

#cask "java"
#brew "cask-repair"
#brew "certbot"
#brew "csv-fix"
#brew "ctags"
#brew "elasticsearch"
#brew "elixir"
#brew "erlang"
#brew "exercism"
#brew "percona-toolkit"
#brew "pgtune"
#brew "imagemagick@6"
#brew "phantomjs"
#brew "sqlite"
#brew "python"
#brew "r"
#brew "the_silver_searcher"
#brew "tmate"

#tap "staticfloat/julia"
#brew "staticfloat/julia/julia"

cask "atom"
cask "deltawalker"
cask "dragondisk"
cask "github"
cask "imageoptim"
cask "licecap"
cask "ngrok"
cask "paw"
#cask "rstudio"
cask "sequel-pro"
cask "sourcetree"
cask "tableau-public"
cask "visual-studio-code"

#cask "elm-platform"
