vscode "aki77.rails-db-schema"
vscode "aki77.rails-routes"
vscode "anthropic.claude-code"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bruno-api-client.bruno"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "docker.docker"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eskimoblood.create-test"
vscode "fabian-hiller.pace-theme"
vscode "formulahendry.code-runner"
vscode "ghbozz.hashtag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gurgeous.bust-a-gem"
vscode "koichisasada.vscode-rdbg"
vscode "marcoroth.stimulus-lsp"
vscode "marp-team.marp-vscode"
vscode "mickey.code-copy-ruby-ref"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "mtxr.sqltools-driver-sqlite"
vscode "nisseya.marp-paste-image-macos"
vscode "noku.rails-run-spec-vscode"
vscode "openai.chatgpt"
vscode "orepor.color-tabs-vscode-ext"
vscode "paulolteanu.theme-railscasts"
vscode "radiolevity.neofloss"
vscode "searking.preview-vscode"
vscode "shanehofstetter.rails-open-partial"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "stripe.endsmart"
vscode "tavo.rails-schema"
vscode "vue.volar"
vscode "wart.ariake-dark"
