tap "amalshaji/taps"
tap "axllent/apps"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "hpedrorodrigues/tools"
tap "k1low/tap"
tap "mas-cli/tap"
tap "microsoft/git"
tap "nikitabobko/tap"
tap "puma/puma"
# Thoughtbot unused code finder
# tap "unused-code/formulae"
# Run your GitHub Actions locally
brew "act"
# All-in-one AI-Powered CLI Chat & Copilot
brew "aichat"
# Download with resuming and segmented downloading
brew "aria2"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# New way to see and navigate directory trees
brew "broot"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Command-line tool to interact with exercism.io
brew "exercism"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Render markdown on the CLI
brew "glow"
# Process manager for Procfile-based applications
brew "hivemind"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Website copier/offline browser
brew "httrack"
# Run and Test HTTP Requests with plain text and curl
brew "hurl"
# Command-line benchmarking tool
brew "hyperfine"
# Database of common MIME types
brew "shared-mime-info"
# Serializes the output of command-line tools to structured JSON output
brew "jc"
# Convert JPG images to ASCII
brew "jp2a"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Terminal file manager
brew "lf"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Curses-based tool for viewing and analyzing log files
brew "lnav"
# Shows thumbnails in terminal using sixel graphics
brew "lsix"
# Security and system auditing tool to harden systems
brew "lynis"
# Keep your Mac's application settings in sync
brew "mackup"
# Securely transfers data between computers
brew "magic-wormhole"
# Easily convert Marp Markdown files into static HTML/CSS, PDF, PPT and images
brew "marp-cli"
# Fly through your shell history
brew "mcfly"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Network grep
brew "ngrep"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Data loading tool for PostgreSQL
brew "pgloader"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Object-relational database system
brew "postgresql@16"
# Wrapper to colorize and simplify ping's output
brew "prettyping"
# Modern replacement for ps written by Rust
brew "procs"
# Monitor data's progress through a pipe
brew "pv"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Wrapper around ripgrep that adds multiple rich file types
brew "ripgrep-all"
# Command-line tool for the Amazon S3 service
brew "s3cmd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Modern and pretty fancy file manager for the terminal
brew "superfile"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Anonymizing overlay network for TCP
brew "tor"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Ultra fast grep with query UI, fuzzy search, archive search, and more
brew "ugrep"
# Modern watch command
brew "viddy"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
brew "amalshaji/taps/portr"
# An email and SMTP testing tool with API for developers
brew "axllent/apps/mailpit"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
# Mac App Store command-line interface
brew "mas-cli/tap/mas"
# PostgreSQL Extensions Manager
brew "pgxman/tap/pgxman"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# Identify potentially unused code
# brew "unused-code/formulae/unused"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# File and photo tweaking tool
cask "a-better-finder-attributes"
# Renamer for files, music and photos
cask "a-better-finder-rename"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application launcher and productivity software
cask "alfred"
# Enable Windows-like alt-tab
cask "alt-tab"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Redis desktop manager
cask "another-redis-desktop-manager"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Multi-cloud backup application
cask "arq"
# Audio utility
cask "background-music"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Tool to customise input devices and automate computer systems
cask "bettertouchtool"
# Bookmarks manager
cask "bookmacster"
# Scriptable scratchpad for developers
cask "boop"
# Opensource IDE for exploring and testing api's
cask "bruno"
# E-books management software
cask "calibre"
# Use your phone as a high-quality webcam with image tuning controls
cask "camo-studio"
# Contacts manager
cask "cardhop"
# Open links in any browser
cask "choosy"
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Downloads videos and audio from websites
cask "clipgrab"
# Server and cloud storage browser
cask "cyberduck"
# Disk space visualiser
cask "daisydisk"
# Universal database tool and SQL client
cask "dbeaver-community"# Tool to compare and synchronise files and folders
cask "deltawalker"
# Voice and text chat software
cask "discord"
# Application window manager focusing on simplicity
cask "divvy"
# Command-line utility for managing macOS dock items
cask "dockutil"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Finds duplicate files in a computer system
cask "dupeguru"
# Control your Elgato key lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Network drive and browser for cloud storage
cask "expandrive"
# Calendar software
cask "fantastical"
# Web browser
cask "firefox"
# Screenshot software
cask "flameshot"
# Tool to turn a website into a desktop app
cask "fluid"
# Developer targeted fonts with a high number of glyphs
cask "font-anonymice-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-bitstream-vera-sans-mono-nerd-font"
# Neutral programming typeface
cask "font-commit-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Variable font designed for display
cask "font-inter"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-monaspace-nerd-font"
cask "font-public-sans"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
cask "git-credential-manager-core"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Graphically shows disk usage within a file system
cask "grandperspective"
# Desktop automation application
cask "hammerspoon"
# Automated organisation
cask "hazel"
# Free and open-source media player
cask "iina"
# System monitoring app
cask "istat-menus"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Menu bar manager
cask "jordanbaird-ice"
# Spot and merge differences in text and image files or folders
cask "kaleidoscope"
# Keyboard customiser
cask "karabiner-elements"
# Tool to prevent the system from going into sleep mode
cask "keepingyouawake"
# File archiver
cask "keka"
# Automation software
cask "keyboard-maestro"
# Open-source keystroke visualiser
cask "keycastr"
# Finds, learns and remembers keyboard shortcuts
cask "keycue"
# ZSA keyboard firmware flasher
cask "keymapp"
# Animated screen capture application
cask "licecap"
# Host-based application firewall
cask "little-snitch"
# Ergonomic Assistant to prevent health problems
cask "macbreakz"
# Open-source Markdown editor
cask "macdown"
# Email tracker, read receipt and spy pixel blocker plugin for Apple Mail
cask "mailtrackerblocker"
# Extensible two-pane file manager
cask "marta"
# Monitors and reports any microphone and camera activity
cask "micro-snitch"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Scheduling application focusing on organisation
cask "omnifocus"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Replacement for Docker Desktop
cask "orbstack"
# WebKit based web browser
cask "orion"
# Client for Proton Drive
cask "proton-drive"
# VPN client focusing on security
cask "protonvpn"
# Automatic time tracker
cask "qbserve"
# Display image info and preview unsupported formats in QuickLook
cask "qlimagesize"
# Quick Look generator for Markdown files
cask "qlmarkdown"
# Quick Look plugin to view patch files
cask "qlprettypatch"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Thumbnails, static previews, cover art and metadata for video files
cask "qlvideo"
# Quick Look plugin for CSV files
cask "quicklook-csv"
# Quick Look plugin for JSON files
cask "quicklook-json"
# QuickTime 7 style Apple Music controller
cask "quicktune"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimised for blind people
cask "rocket"
# Print driver for printing documents directly to a pdf file
cask "rwts-pdfwriter"
# Tool to reverse the direction of scrolling
cask "scroll-reverser"
# Block your own access to distracting websites
cask "selfcontrol"
# Collection of apps available by subscription
cask "setapp"
# Traditional roguelike dungeon crawler with randomised levels, enemies and items
cask "shattered-pixel-dungeon"
# App that enables mouse-free UI interaction
cask "shortcat"
# PDF reader and note-taking application
cask "skim"
# Displays all open files and sockets in use by all running processes
cask "sloth"
# Control your Sonos system
cask "sonos"
# Controller for Gen 1 Sonos products
cask "sonos-s1-controller"
# Graphical client for Git version control
cask "sourcetree"
# Music streaming service
cask "spotify"
# Break time reminder app
cask "stretchly"
# Text editor for code, markup and prose
cask "sublime-text"
# Backup, recovery and cloning software
cask "superduper"
# Application for inspecting installer packages
cask "suspicious-package"
# Replacement for RCDefaultApps, written in Swift
cask "swiftdefaultappsprefpane"
# Real time file synchronisation software
cask "syncthing"
# Messaging app with a focus on speed and security
cask "telegram"
# Unpacks archive files
cask "the-unarchiver"
# Record screen and camera time lapses in a menu bar interface
cask "timelapze"
# Web browser focusing on security
cask "tor-browser"
# Managing Pull Requests and Issues For GitHub & GitHub Enterprise
cask "trailer"
# Open-source BitTorrent client
cask "transmission"
# Configurable document editor that supports Markdown
cask "typora"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Unpacks archive files
cask "the-unarchiver"
# Managing Pull Requests and Issues For GitHub & GitHub Enterprise
cask "trailer"
# Multimedia player
cask "vlc"
# Multiplayer code editor
cask "zed"
# Desktop client for the Zulip team chat platform
cask "zulip"
mas "1Password for Safari", id: 1569813296
mas "Actions", id: 1586435171
mas "Actions For Obsidian", id: 1659667937
mas "Be Focused Pro", id: 961632517
mas "Bears", id: 6443609622
mas "Capital One Shopping", id: 1477110326
mas "com.kirsteins.chords-and-scales-mac", id: 1435473426
mas "Crouton", id: 1461650987
mas "Deliveries", id: 290986013
mas "Focus Matrix", id: 1087284172
mas "Goodnotes", id: 1444383602
mas "HotwireDevTools", id: 6503706225
mas "Hush", id: 1544743900
mas "Magnet", id: 441258766
mas "Microsoft Remote Desktop", id: 1295203466
mas "myTuner Radio", id: 881415018
mas "Omnivore", id: 1564031042
mas "Pixelmator", id: 407963104
mas "Pocket", id: 568494494
mas "PolyNome", id: 488165644
mas "Reeder", id: 1449412482
mas "Save to Pocket", id: 1477385213
mas "Simple Metronome", id: 1604183938
mas "SomaFM", id: 449155338
mas "StopTheMadness Pro", id: 6471380298
mas "Things", id: 904280696
mas "Velja", id: 1607635845
mas "Wayback Machine", id: 1472432422
mas "Xcode", id: 497799835

